'''
Завдання 2

Створіть гру Mario на Python.

Додаткові матеріали:
Відтворити відео


Вимоги:
• Вихідний код має бути розміщений на github або іншому подібному сервісі.
• Створіть архітектуру застосунку на рівні класів.
• Побудуйте діаграму класів, збережіть її у проекті.
• У грі обов'язково мають бути класи Player, Monster, Platform, BlockDie, BlockTeleport, Princess, Camera.
• Декомпозиція та композиція.
• Інкапсуляція, успадкування та поліморфізм.
• Створення спеціальних типів даних.
• Додайте зв'язок компонентів між собою.
• Використовуйте бібліотеку pygame.
• Наприкінці додайте тестування (за можливістю).
'''