''' Integer2◦ . Дано масу M у кілограмах. Використовуючи операцію ділення націло,
знайти кількість повних тонн у ній (1 тонна = 1000 кг).
'''
#M = 55542
#res = M // 1000

#print(res)

''' Integer3◦ . Дано розмір файлу в байтах. Використовуючи операцію ділення націло, 
знайти кількість повних кілобайтів, які займає цей файл (1 кілобайт = 1024 байта). '''

#S = 13424
#res = S // 1000

#print(res)



''' Integer4◦ . Дано цілі додатні числа A і B (A > B). 
На відрізку довжини A розміщено максимально можливу кількість відрізків довжини B (без накладень). 
Використовуючи операцію ділення націло, знайти кількість відрізків B, розміщених на відрізку A'''

#A = 10
#B = 8
#res = A // B
#print(res)

''' Integer5◦ . Дано цілі додатні числа A і B (A > B). 
На відрізку довжини A розміщено максимально можливу кількість відрізків довжини B (безнакладень). 
Використовуючи операцію взяття залишку від ділення націло , знайти довжину незайнятої частини відрізка A.'''

#A = 15
#B = 6
#res = A % B
#print(res)



''' Integer6◦ . Дано двозначне число. Вивести спочатку його ліву цифру (десятки), а потім - його праву цифру (одиниці).
Для знаходження десятків використовувати операцію ділення націло, для знаходження одиниць - операцію взяття залишку від ділення.
 '''

a = 22
first_number = a // 10
second_number = a % 10
print(first_number)
print(second_number)







''' Integer7◦ . Дано двозначне число. Знайти суму і добуток його цифр '''



