'''
For1. Дано цілі числа K і N (N > 0). Вивести N разів число K.
For2. Дано два цілих числа A і B (A < B). Вивести в порядку зростання всі цілі числа, розташовані між A і B (включаючи самі числа A і B), а також кількість N цих чисел.
For3. Дано два цілих числа A і B (A < B). Вивести в порядку убування всі цілі числа, розташовані між A і B (не включаючи числа A і B), а також кількість N цих чисел.
For4. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1, 2, . . . , 10 кг цукерок.
For5◦ . Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 0.1, 0.2, . . . , 1 кг цукерок.
For6. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1.2, 1.4, . . . , 2 кг цукерок.
For7. Дано два цілих числа A і B (A < B). Знайти суму всіх цілих чисел від A до B включно.
For8. Дано два цілих числа A і B (A < B). Знайти добуток усіх цілих чисел від A до B включно.
For9. Дано два цілих числа A і B (A < B). Знайти суму вадратів усіх цілих чисел від A до B включно.
For10. Дано ціле число N (> 0). Знайти суму 1 + 1/2 + 1/3 + . . . . + 1/N
(дійсне число).
For11◦ . Дано ціле число N (> 0). Знайти добуток 1.1 - 1.2 - 1.3 - . . . .
(N співмножників).
For12◦ .Дано дійсне число A і ціле число N (> 0). Знайти всі цілі ступені числа A від 1 до N.
While1◦ . Дано додатні числа A і B (A > B). На відрізку довжини A розміщено максимально можливу кількість відрізків довжини B (без накладень). Не використовуючи операції множення і ділення, знайти довжину незайнятої частини відрізка A.
While2◦ . Дано додатні числа A і B (A > B). На відрізку довжини A розміщено максимально можливу кількість розміщено максимально можливу кількість відрізків довжини B (без накладень). Не використовуючи операції множення і ділення, знайти кількість відрізків B, розміщених на відрізку A.
While3. Дано цілі додатні числа N і K. Використовуючи тільки операції додавання і віднімання, знайти частку від ділення націло N на K, а також залишок від цього ділення.
While4◦ . Дано ціле число N (> 0). Якщо воно є ступенем числа 3, то вивести TRUE, якщо не є - вивести FALSE.
'''




'''
For2. Дано два цілих числа A і B (A < B). Вивести в порядку зростання всі цілі числа, розташовані між A і B (включаючи самі числа A і B), а також кількість N цих чисел.
'''

# A = 5
# B = 7
# C = 0
#
# for i in range(A, B + 1):
#     print(i)
#     C += 1
# print(C)


'''
For3. Дано два цілих числа A і B (A < B). Вивести в порядку убування всі цілі числа, розташовані між A і B (не включаючи числа A і B), а також кількість N цих чисел.
'''
# A = 5
# B = 10
# N = B - A - 1
#
# for number in range(A + 1 ,B):
#     print(number)

'''
For4. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1, 2, . . . , 10 кг цукерок.
'''
# price_for_kg = 4
#
# for kg in range(1, 11):
#     prices_for_kgs = price_for_kg * kg
#     print(f"{prices_for_kgs} € for {kg} kg ")


'''
For5◦ . Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 0.1, 0.2, . . . , 1 кг цукерок.
'''
#
# price_for_kg = 4
# for kg in range(1, 11):
#     prices_for_kgs = (price_for_kg * kg) / 10
#     print(f"{prices_for_kgs} € for {kg / 10} kg ")

'''
For6. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1.2, 1.4, . . . , 2 кг цукерок.
'''
# price_for_kg = 4
# for kg in range(12, 21, 2):
#     prices_for_kgs = (price_for_kg * kg) / 10
#     print(f"{prices_for_kgs} € for {kg / 10 } kg ")


'''
For7. Дано два цілих числа A і B (A < B). Знайти суму всіх цілих чисел від A до B включно
'''
# A = 5
# B = 10
# sum_between_AB = 0
# for number in range(A, B + 1):
#     sum_between_AB += number
# print(f"the amount between A and B is {sum_between_AB}")


'''
For8. Дано два цілих числа A і B (A < B). Знайти добуток усіх цілих чисел від A до B включно
'''
# A = 5
# B = 10
# sum_between_AB = 1
#
# for number in range(A, B + 1):
#     sum_between_AB *= number
#
# print(sum_between_AB)


'''
For9. Дано два цілих числа A і B (A < B). Знайти суму квадратів усіх цілих чисел від A до B включно.
'''
# A = 5
# B = 10
# sum_between_AB = 0
#
# for number in range(A, B + 1):
#     quad_AB = number ** 2
#     sum_between_AB += quad_AB
# print(sum_between_AB)

'''
For10. Дано ціле число N (> 0). Знайти суму 1 + 1/2 + 1/3 + . . . . + 1/N
(дійсне число).
'''

# N = 5
# sum_to_N = 0
# for number in range(1, N + 1):
#     sum_to_N += 1 / number
# print(sum_to_N)


'''
For11◦ . Дано ціле число N (> 0). Знайти добуток 1.1 - 1.2 - 1.3 - . . . .
(N співмножників).
'''
# N = 5
# product = 1
# for number in range(1, N + 1):
#     factor = 1 + number / 10
#     product *= factor
#     print(factor)
#
# print("Product:", product)


'''
For12◦ .Дано дійсне число A і ціле число N (> 0). Знайти всі цілі ступені числа A від 1 до N.
'''

# A = 5
# N = 10
#
# for number in range(1, N + 1):
#     product = A ** number
#
#     print(product)

'''
While1◦ . Дано додатні числа A і B (A > B). На відрізку довжини A розміщено максимально можливу кількість відрізків довжини B (без накладень). 
Не використовуючи операції множення і ділення, знайти довжину незайнятої частини відрізка A.
'''

# A = 10
# B = 3
# while A >= B:
#     A = A - B
#
# print(A)


'''
While2◦ . Дано додатні числа A і B (A > B). 
На відрізку довжини A розміщено максимально можливу кількість розміщено максимально можливу кількість відрізків довжини B (без накладень). 
Не використовуючи операції множення і ділення, знайти кількість відрізків B, розміщених на відрізку A.
'''

# A = 10
# B = 3
# count = 0
#
# while A >= B:
#     A = A - B
#     count += 1
#     print(A)
#
# print(f"There are {count}   between A and B.")


'''
While3. Дано цілі додатні числа N і K. 
Використовуючи тільки операції додавання і віднімання, знайти частку від ділення націло N на K, а також залишок від цього ділення.
'''
# N = 10
# K = 3
# count = 0
# while N >= K:
#     N = N - K
#     count += 1
#
# remainder = N
#
# print(count)
# print(remainder)


'''
While4◦ . Дано ціле число N (> 0). 
Якщо воно є ступенем числа 3, то вивести TRUE, якщо не є - вивести FALSE.
'''

# N = 9
# number = 1
# while number < N:
#     number = number * 3
#
# if number == N:
#     print(True)
# else:
#     print(False)