
'''
Задача 1: «Геймер» (Списки та індекси)
Створи список games із трьома іграми (наприклад, ["Wild Rift", "Cyberpunk 2077", "RDR2"]).

Виведи на екран першу гру.

Виведи останню гру, використовуючи від'ємний індекс.

Заміни другу гру в списку на "Відьмак 3" та виведи оновлений список.

'''
# games_list = ["Wild Rift", "Cyberpunk 2077", "RDR2"]
# games_list[1] = "Відьмак 3"
#
# print(games_list[0])
# print(games_list[-1])
# print(games_list[1])
# print(games_list)

'''
Задача 2: «Координати» (Розпакування кортежів)
Дано кортеж із координатами точки у 3D-просторі: point = (15, 28, 7).

Розпакуй цей кортеж у три змінні: x, y та z.

Виведи їх на екран у форматі: Координата X: 15, Координата Y: 28, Координата Z: 7.

# '''
#
# point = (15, 28, 7)
# x, y, z = point
# print(f"coordinate X: {x}, coordinate Y:{y}, coordinate Z:{z}")


'''
Задача 3: «Спортивна дієта» (Методи списків)
Створи порожній список diet.

Додай до нього "Яєчні білки" та "Сир" (використовуй метод append).

Встав "BCAA" на найперше місце (індекс 0), використовуючи метод insert.

Видали останній доданий елемент за допомогою методу pop() і виведи підсумковий список.
'''
# diet = []
# diet.append("proteins")
# diet.append("cheese")
# diet.insert(0, "BCAA")
# diet.pop()
# print(diet)

'''
Задача 4: «Стрибки на скакалці» (Списки + цикл for)
Дано список із кількістю стрибків за різні тренувальні підходи: jumps = [1200, 1500, 800, 1450, 400, 1300].
Напиши цикл for, який пройдеться по цьому списку і виведе на екран тільки ті значення, які більші або дорівнюють 1000.
'''

# jumps = [1200, 1500, 800, 1450, 400, 1300]
# for jump in jumps:
#     if jump >= 1000:
#         print(jump)
#     else:
#         print("this jumps is less than 1000")


'''
Задача 5: «Мутація системи» (Кортежі -> Списки -> Кортежі)
У тебе є кортеж із розширеннями: extensions = ("Just Perfection", "Ulauncher").
Оскільки кортеж змінювати не можна, зроби наступне:

Перетвори його на список.

Додай у кінець розширення "Dash to Dock".

Перетвори список назад на кортеж і виведи результат.
'''

# extensions = ["Just Perfection", "Ulauncher"]
#
# extensions = list(extensions)
# print(type(extensions))
# extensions.append("Dash to Dock")
#
# extensions = tuple(extensions)
# print(type(extensions))
# print(extensions)


'''
Задача 6: «Фільтрація багів» (Фільтрація списків)
Дано список статусів тікетів: tickets = ["bug", "feature", "critical_bug", "typo", "blocker", "ui_issue"].
Створи два нових порожніх списки: urgent та minor.
Пройдись циклом по списку tickets. Якщо довжина слова більше 7 символів, додай його до urgent, якщо 7 і менше — до minor. Виведи обидва нові списки.
'''

# tickets = ["bug", "feature", "critical_bug", "typo", "blocker", "ui_issue"]
# urgent = []
# minor = []
# for ticket in tickets:
#     if len(ticket) > 7:
#         urgent.append(ticket)
#     elif len(ticket) < 7:
#         minor.append(ticket)
#
# print(urgent)
# print(minor)


'''
Задача 7: «Тестування API» (Список кортежів)
Дано список, у якому зберігаються кортежі з ендпоінтами та часом їх відповіді (у мілісекундах):
endpoints = [("/login", 120), ("/profile", 350), ("/data", 80), ("/settings", 410)]

Напиши цикл, який виведе рядок для кожного ендпоінта: "Запит до [Ендпоінт] тривав [Час] мс".

Порахуй середній час відповіді всіх ендпоінтів і виведи його на екран.
'''

# endpoints = [("/login", 120), ("/profile", 350), ("/data", 80), ("/settings", 410)]
# total_time = 0
#
# for endpoint in endpoints:
#     path, time = endpoint
#     print(f"Запит до {path} тривав {time} мс")
#     total_time += time
#
# avg_time = total_time / len(endpoints)
# print(f"average time is {avg_time}")


'''
Задача 8: «Статистика логів» (Підрахунок та видалення)
Дано список статус-кодів відповідей сервера:
codes = [200, 404, 200, 500, 200, 404, 502, 200]

Використовуючи метод списку, порахуй і виведи, скільки разів зустрічається код 200.

Використовуючи цикл while та метод remove(), видали зі списку всі помилки 404. Виведи очищений список.
'''

#
# codes = [200, 404, 200, 500, 200, 404, 502, 200]
# total_code = 0
# for code in codes:
#     if code == 200:
#         total_code += 1
#     else:
#         print("Code is not 200")
# print(f"the number 200 {total_code} times")
#
# while 404 in codes:
#     codes.remove(404)
# print(codes)



'''
Задача 9: «Шифр QA-інженера» (Зрізи)
Дано список літер: message = ["А", "в", "в", "т", "т", "о", "о", "м", "м", "а", "а", "т", "т", "и", "и", "з", "з", "а", "а", "ц", "ц", "і", "і", "я"].

За допомогою зрізів (slices) отримай кожну другу літеру з цього списку (щоб прочитати приховане слово).

За допомогою зрізів розверни вихідний список задом наперед.
'''
# message = ["А", "в", "в", "т", "т", "о", "о", "м", "м", "а", "а", "т", "т", "и", "и", "з", "з", "а", "а", "ц", "ц", "і", "і", "я"]
#
# new_message = message[::2]
#
# print("".join(new_message))
# print(message[::-1])



'''
Задача 10: «Матриця тест-кейсів» (Вкладені списки)

Створи список test_matrix, який містить три інші списки. Кожен внутрішній список повинен складатися з трьох нулів [0, 0, 0]. Це матриця 3х3.

Звернувшись за індексами, зміни центральний елемент матриці (другий елемент другого списку) на 1 (імітуючи знайдений дефект).

Напиши цикл for, який виведе матрицю красиво (кожен внутрішній список на новому рядку).
Очікуваний вивід:
[0, 0, 0]
[0, 1, 0]
[0, 0, 0]
'''
# test_matrix = [[0, 0, 0], [0, 0, 0], [0, 0, 0]]
# test_matrix[1][1] = 1
#
# for matrix in test_matrix:
#     print(matrix)
