'''
Рівень 1: Базові задачі (Легкі)
Мета: навчитися створювати списки, змінювати їх, звертатися за індексами та використовувати основні методи.

Задача 1: «Список розробників» (Створення та індексація)
Створи список developers, який містить 5 імен: ["Олексій", "Анна", "Дмитро", "Олена", "Максим"].

Виведи на екран перше ім'я зі списку.

Виведи третє ім'я зі списку.

Виведи останнє ім'я, використовуючи від'ємний індекс (-1).

Задача 2: «Оновлення софту» (Зміна елементів)
Дано список операційних систем: os_list = ["Ubuntu", "Windows", "macOS", "Fedora"].

Заміни елемент "Windows" на "Debian".

Виведи весь оновлений список на екран.

Задача 3: «Черга завдань» (Додавання елементів)
Створи порожній список tasks.

Додай у кінець списку завдання "Написати автотест", використовуючи метод append().

Додай у кінець списку завдання "Перевірити баг-репорт".

За допомогою методу insert() додай на саме перше місце (індекс 0) завдання "Прочитати документацію".

Виведи фінальний список на екран.

Задача 4: «Очищення логів» (Видалення елементів)
Дано список помилок, які знайшли під час тестування: errors = ["404", "500", "401", "404", "403"].

Видали першу помилку "404" за допомогою методу remove().

Видали останній елемент списку за допомогою методу pop().

Виведи список, що залишився.

Задача 5: «Перевірка наявності» (Оператор in)
Дано список встановлених у системі пакетів: installed = ["python", "pytest", "git", "docker", "pip"].

Напиши конструкцію if/else, яка перевіряє, чи є пакет "nginx" у цьому списку. Якщо є — виведи "Встановлено", якщо ні — "Потрібно встановити".

Зроби таку ж перевірку для пакета "pytest".

Рівень 2: Середня важкість
Мета: навчитися комбінувати списки з циклами for/while, використовувати зрізи та обробляти числові дані.

Задача 6: «Фільтрація чисел» (Цикл for + умови)
Дано список результатів вимірювання швидкості завантаження сторінки (у мілісекундах):
ping_times = [45, 120, 85, 210, 60, 315, 90]
Створи новий порожній список slow_pings. Напиши цикл for, який перевірить кожен елемент списку ping_times. Якщо час завантаження більший за 100 мс, додай це значення в список slow_pings. Виведи результат.

Задача 7: «Аналітика метрик» (Агрегація даних)
Дано список кількості виконаних тестів за кожен день тижня:
test_counts = [25, 40, 15, 50, 30, 0, 5]
Напиши код (використовуючи вбудовані функції Python sum(), len(), min(), max()), який обчислить і виведе:

Загальну кількість виконаних тестів за тиждень (суму).

Середню кількість тестів за день.

Мінімальну та максимальну кількість тестів за день.

Задача 8: «Робота зі зрізами» (Slices)
Дано список елементів інтерфейсу:
elements = ["Button", "Input", "Checkbox", "Dropdown", "Modal", "Header", "Footer"]

Використовуючи зрізи, виведи перші три елементи.

Використовуючи зрізи, виведи елементи з індексу 2 по індекс 5 (включно).

Скопіюй цей список у зворотному порядку (розверни його) за допомогою зрізу та виведи на екран.

Задача 9: «Пошук дублікатів» (Метод count + while)
Дано список тегів для статей:
tags = ["python", "qa", "python", "automation", "qa", "python", "linux"]

За допомогою методу count() порахуй і виведи, скільки разів тег "python" зустрічається у списку.

Напиши цикл while, який повністю видалить усі згадки тегу "qa" зі списку (оскільки метод .remove() видаляє лише перше входження за раз). Виведи очищений список.

Задача 10: «Двовимірний масив» (Вкладені списки)
Уявіть таблицю (матрицю) розміром 3х3, яка відображає стан трьох серверів (де 1 — працює, 0 — впав):
servers = [[1, 1, 0], [1, 0, 1], [0, 1, 1]]

Виведи на екран стан другого сервера (це другий рядок, тобто весь другий список).

Зміни значення в першому рядку для третього сервера з 0 на 1 (імітуємо, що сервер підняли).

Напиши цикл for, який виведе кожен підсписок на новому рядку, щоб таблиця виглядала наочно.

'''





'''
Задача 1: «Список розробників» (Створення та індексація)
Створи список developers, який містить 5 імен: ["Олексій", "Анна", "Дмитро", "Олена", "Максим"].

Виведи на екран перше ім'я зі списку.

Виведи третє ім'я зі списку.

Виведи останнє ім'я, використовуючи від'ємний індекс (-1).
'''

# developers = ["Олексій", "Анна", "Дмитро", "Олена", "Максим"]
#
# print(developers[0])
# print(developers[2])
# print(developers[-1])

'''
Задача 2: «Оновлення софту» (Зміна елементів)
Дано список операційних систем: os_list = ["Ubuntu", "Windows", "macOS", "Fedora"].

Заміни елемент "Windows" на "Debian".

Виведи весь оновлений список на екран.
'''

# os_list = ["Ubuntu", "Windows", "macOS", "Fedora"]
#
# os_list[1] = ("Debian")
#
# print(os_list)


'''
Задача 3: «Черга завдань» (Додавання елементів)
Створи порожній список tasks.

Додай у кінець списку завдання "Написати автотест", використовуючи метод append().

Додай у кінець списку завдання "Перевірити баг-репорт".

За допомогою методу insert() додай на саме перше місце (індекс 0) завдання "Прочитати документацію".

Виведи фінальний список на екран.
'''
# tasks = []
# tasks.append("Написати автотест")
# tasks.append("Перевірити баг-репорт")
# tasks.insert(0, "Прочитати документацію")
#
# print(tasks)


'''
Задача 4: «Очищення логів» (Видалення елементів)
Дано список помилок, які знайшли під час тестування: errors = ["404", "500", "401", "404", "403"].

Видали першу помилку "404" за допомогою методу remove().

Видали останній елемент списку за допомогою методу pop().

Виведи список, що залишився.
'''
# errors = ["404", "500", "401", "404", "403"]
# errors.remove("404")
# errors.pop(-1)
# print(errors)


'''
Задача 5: «Перевірка наявності» (Оператор in)
Дано список встановлених у системі пакетів: installed = ["python", "pytest", "git", "docker", "pip"].

Напиши конструкцію if/else, яка перевіряє, чи є пакет "nginx" у цьому списку. Якщо є — виведи "Встановлено", якщо ні — "Потрібно встановити".

Зроби таку ж перевірку для пакета "pytest".

'''
# installed = ["python", "pytest", "git", "docker", "pip"]
#
# if "nginx" in installed:
#     print("nginx Встановлено")
# else:
#     print("nginx Потрібно встановити")
#
# if "pytest" in installed:
#     print("pytest Встановлено")
# else:
#     print("pytest Потрібно встановити")



'''
Задача 6: «Фільтрація чисел» (Цикл for + умови)
Дано список результатів вимірювання швидкості завантаження сторінки (у мілісекундах):
ping_times = [45, 120, 85, 210, 60, 315, 90]
Створи новий порожній список slow_pings. Напиши цикл for, який перевірить кожен елемент списку ping_times. 
Якщо час завантаження більший за 100 мс, додай це значення в список slow_pings. Виведи результат.
'''
# ping_times = [45, 120, 85, 210, 60, 315, 90]
# slow_pings = []
#
# for ping in ping_times:
#     if ping > 100:
#         slow_pings.append(ping)
#
# print(f"the are {slow_pings} slow pings")


'''
Задача 7: «Аналітика метрик» (Агрегація даних)
Дано список кількості виконаних тестів за кожен день тижня:
test_counts = [25, 40, 15, 50, 30, 0, 5]
Напиши код (використовуючи вбудовані функції Python sum(), len(), min(), max()), який обчислить і виведе:

Загальну кількість виконаних тестів за тиждень (суму).

Середню кількість тестів за день.

Мінімальну та максимальну кількість тестів за день.
'''
# test_counts = [25, 40, 15, 50, 30, 0, 5]
#
# amount_test_count = sum(test_counts)
# avg_test_count = amount_test_count / len(test_counts)
# min_test_count = min(test_counts)
# max_test_count = max(test_counts)
#
# print(f"amount {amount_test_count}")
# print(f"avg {avg_test_count}")
# print(f"min {min_test_count}")
# print(f"max {max_test_count}")



'''
Задача 8: «Робота зі зрізами» (Slices)
Дано список елементів інтерфейсу:
elements = ["Button", "Input", "Checkbox", "Dropdown", "Modal", "Header", "Footer"]

Використовуючи зрізи, виведи перші три елементи.

Використовуючи зрізи, виведи елементи з індексу 2 по індекс 5 (включно).

Скопіюй цей список у зворотному порядку (розверни його) за допомогою зрізу та виведи на екран.
'''
# elements = ["Button", "Input", "Checkbox", "Dropdown", "Modal", "Header", "Footer"]
# first_elements = elements[0:3]
# second_elements = elements[2:6]
# third_elements = elements[::-1]
#
# print(first_elements)
# print(second_elements)
# print(third_elements)



'''
Задача 9: «Пошук дублікатів» (Метод count + while)
Дано список тегів для статей:
tags = ["python", "qa", "python", "automation", "qa", "python", "linux"]

За допомогою методу count() порахуй і виведи, скільки разів тег "python" зустрічається у списку.

Напиши цикл while, який повністю видалить усі згадки тегу "qa" зі списку (оскільки метод .remove() видаляє лише перше входження за раз). 
Виведи очищений список.
'''
# tags = ["python", "qa", "python", "automation", "qa", "python", "linux"]
#
# value_count_in_tags = tags.count("python")
# print(value_count_in_tags)
#
# while "qa" in tags:
#     tags.remove("qa")
#
# print(tags)


'''
Задача 10: «Двовимірний масив» (Вкладені списки)
Уявіть таблицю (матрицю) розміром 3х3, яка відображає стан трьох серверів (де 1 — працює, 0 — впав):
servers = [[1, 1, 0], [1, 0, 1], [0, 1, 1]]

Виведи на екран стан другого сервера (це другий рядок, тобто весь другий список).

Зміни значення в першому рядку для третього сервера з 0 на 1 (імітуємо, що сервер підняли).

Напиши цикл for, який виведе кожен підсписок на новому рядку, щоб таблиця виглядала наочно.
'''



servers = [[1, 1, 0], [1, 0, 1], [0, 1, 1]]
second_server = servers[1]
print(f"second server is {second_server}")

servers[2][0] = 1


for server in servers:
    print(server)