"""
Завдання 1

Створіть список та введіть його значення. Знайдіть найбільший та найменший елемент списку, а також суму та середнє арифметичне його значень.

Завдання 2

Є два списки, які наповнюються користувачем з клавіатури. Сформувати список, в якому будуть міститися унікальні значення першого відносно другого списку та навпаки без повторень. Роздрукувати підсумковий об'єкт на екран в прямій послідовності, зворотній, а також виконати сортування за зростанням та спаданням.

Завдання 3

Простим називається число, яке ділиться націло лише на одиницю і на саме себе. Число 1 не вважається простим. Напишіть програму, яка знаходить усі прості числа в заданому проміжку, виводить їх на екран, а потім на вимогу користувача виводить їхню суму або добуток.

Завдання 4

Створіть цілочисельний список, введіть кількість його елементів і самі значення. Передбачити меню, в якому: після натискання клавіші 1 ці значення виведуться на екран у зворотному порядку, а після натискання клавіші 2 – за зростанням.

Завдання 5

Створіть список натуральних чисел int_list. Кожне непарне значення списку додайте до нового списку new_list. Користувач вводить з клавіатури кількість повторів списку repeat. Здійсніть дублювання списку new_list, repeat кількість разів. Очистіть список int_list.

Завдання 6

Для цього завдання вихідний список значень беремо з підсумкового списку new_list завдання 5. Користувач вводить з клавіатури значення; якщо таке є у цьому списку — вивести кількість його повторів та його позицію у цьому списку.


"""




"""
Завдання 1 

Створіть список та введіть його значення. 
Знайдіть найбільший та найменший елемент списку, а також суму та середнє арифметичне його значень. 
"""

new_list = [1, 3, 5, 7, 9, 11]

max_list = max(new_list)
min_list = min(new_list)
sum_list = sum(new_list)
avg_list = sum_list / len(new_list)

print(f" max list {max_list}, min list {min_list}, sum list {sum_list}, avg list {avg_list}")



"""
Завдання 2

Є два списки, які наповнюються користувачем з клавіатури. 
Сформувати список, в якому будуть міститися унікальні значення першого відносно другого списку та навпаки без повторень. 
Роздрукувати підсумковий об'єкт на екран в прямій послідовності, зворотній, а також виконати сортування за зростанням та спаданням.
"""




first_list =