"""
Завдання 1

Дано два рядки. Виведіть на екран символи, які є в обох рядках.

Завдання 2

Створіть програму, яка емулює роботу сервісу зі скорочення посилань. Повинна бути реалізована можливість введення початкового посилання та короткої назви і отримання початкового посилання за її назвою.

Завдання 3

Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору, які є в 1 списку (немає в другому) і навпаки.

Завдання 4

Ознайомтеся за допомогою документації з класами OrderedDict, defaultdict та ChainMap модуля collections.

Завдання 5

Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями - кількістю повторів кожного слова у послідовності.

Завдання 6

Створіть прототип програми «Бібліотека», де є можливість перегляду та внесення змін за структурою: автор: твір. Передбачте можливість виведення на екран сортування за автором та твором.

Завдання 7

Створіть прототип програми «Облік кадрів», в якій є можливість перегляду та внесення змін до структури(реалізуйте інтерфейс(меню), за допомогою якого можна робити маніпуляції з даними):

прізвище:

    посада: ...

    досвід роботи: …

    портфоліо: …

    коефіцієнт ефективності: …

    стек технологій: …

    зарплата: …

Передбачте можливість виведення на екран сортування за прізвищем та найефективнішим співробітником.
"""









"""
Завдання 1

Дано два рядки. Виведіть на екран символи, які є в обох рядках.
"""


# first_set = {1, 2, 3}
# second_set = {4, 5, 6}
#
# result_set = first_set.union(second_set)
# print(result_set)




"""
Завдання 2

Створіть програму, яка емулює роботу сервісу зі скорочення посилань. 
Повинна бути реалізована можливість введення початкового посилання та короткої назви і отримання початкового посилання за її назвою.
"""

# user_full_link = input("Please enter the full link: ")
# user_short_link = input("Please enter the short link: ")
# my_link = {user_short_link: user_full_link}
#
# print(my_link)
# print(my_link["full"])
# print(my_link["short_link"])



"""
Завдання 3

Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору, які є в 1 списку (немає в другому) і навпаки.

Завдання
"""

# first_set = {1, 2, 3, 4, 5 }
# second_set = {3, 4, 5, 6, 7, 8}
#
# first_second = first_set - second_set
# second_first = second_set - first_set
#
# print("difference between first and second: ", first_second)
# print("difference between second and first: ", second_first)
#
# full_difference = list(first_set ^ second_set )
# print("full difference: ", full_difference)




"""
Завдання 4

Ознайомтеся за допомогою документації з класами OrderedDict, defaultdict та ChainMap модуля collections.
"""

# OrderedDict  сохраняет порядок добавления элементов
# defaultdict   автоматически создаёт значение по умолчанию, если ключ отсутствует
# ChainMap      объединяет несколько словарей в одну логическую структуру без их копирования


"""
Завдання 5

Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями - кількістю повторів кожного слова у послідовності.
"""


