'''
Boolean1◦ . Дано ціле число A. Перевірити істинність висловлювання:

«Число A є додатним».

Boolean2◦ . Дано ціле число A. Перевірити істинність висловлювання:

«Число A є непарним».

Boolean3◦ . Дано ціле число A. Перевірити істинність висловлювання:

«Число A є парним».

Boolean4◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Справедливі нерівності A > 2 і B ≤ 3».

Boolean5◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Справедливі нерівності A ≥ 0 або B < -2».

Boolean6◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Справедлива подвійна нерівність A < B < C».

Boolean7◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Число B знаходиться між числами A і C».

Boolean8◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Кожне з чисел A і B непарне».

Boolean9◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Хоча б одне з чисел A і B непарне».

Boolean10◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Рівно одне з чисел A і B непарне».

Boolean11◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання:

«Числа A і B мають однакову парність».

Boolean12◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Кожне з чисел A, B, C додатне».

Boolean13◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Хоча б одне з чисел A, B, C додатне».

Boolean14◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Рівно одне з чисел A, B, C додатне».

Boolean15◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання:

«Рівно два з чисел A, B, C є додатними».

Boolean16◦ . Дано ціле додатне число. Перевірити істинність висловлювання:

«Дане число є парним двозначним».

Boolean17◦ . Дано ціле додатне число. Перевірити істинність висловлювання:

«Дане число є непарним тризначним».

Boolean18◦ . Перевірити істинність висловлювання:

«Серед трьох даних цілих чисел є хоча б одна пара таких, що збігаються».

Boolean19◦ . Перевірити істинність висловлювання:

«Серед трьох даних цілих чисел є хоча б одна пара взаємно протилежних».

Boolean20◦ . Дано тризначне число. Перевірити істинність висловлювання:

«Усі цифри даного числа різні».

Boolean21◦ . Дано тризначне число. Перевірити істинність висловлювання:

«Цифри даного числа утворюють зростаючу послідовність».

Boolean22◦ . Дано тризначне число. Перевірити істинність висловлювання:

«Цифри даного числа утворюють зростаючу або спадаючу послідовність».

Boolean23◦ . Дано чотиризначне число. Перевірити істинність висловлювання:

«Дане число читається однаково зліва направо і справа наліво».
'''




'''
Boolean1◦ . Дано ціле число A. Перевірити істинність висловлювання: 

«Число A є додатним».
'''


# def check_number(A):
#     if A > 0:
#         return True
#
# A = 2
# print(check_number(A))


'''
Boolean2◦ . Дано ціле число A. Перевірити істинність висловлювання: 

«Число A є непарним».
'''

# def check_number(A):
#     if A % 2 != 0:
#         return True
#
# A = 3
# print(check_number(A))

'''
Boolean3◦ . Дано ціле число A. Перевірити істинність висловлювання: 

«Число A є парним».
'''

# def check_number(A):
#     if A % 2 == 0:
#         return True
#
# A = 2
# print(check_number(A))



'''
Boolean4◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання: 

«Справедливі нерівності A > 2 і B ≤ 3»
'''

# def check_number(a, b):
#     if a > 2 and b > 3:
#         return True
#
# a = 3
# b = 2
# print(check_number(a, b))


'''
Boolean5◦ . Дано два цілих числа: A, B. Перевірити істинність висловлювання: 

«Справедливі нерівності A ≥ 0 або B < -2».
'''


# def check_number(a, b):
#     if a >= 0 and b <= -2:
#         return True
#
# a = 3
# b = -5
# print(check_number(a, b))


'''
Boolean6◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання: 

«Справедлива подвійна нерівність A < B < C».
'''
# def check_number(a, b, c):
#     if a < b < c:
#         return True
#
# a = 2
# b = 3
# c = 1
# print(check_number(a, b, c))


'''
Boolean7◦ . Дано три цілих числа: A, B, C. Перевірити істинність висловлювання: 

«Число B знаходиться між числами A і C».
'''
#
# def check_number(a, b, c):
#     if a < b < c or c < b < a:
#         return True
#
# a = 5
# b = 3
# c = 1
# print(check_number(a, b, c))

'''

'''