"""
Завдання 1

Прочитайте у документації з мови Python інформацію про перелічені у резюме цього уроку стандартні функції. Перевірте їх на практиці.

Завдання 2

Створіть програму, яка перевіряє, чи є паліндромом введена фраза.

Завдання 3

Нехай на кожну сходинку можна стати з попередньої або переступивши через одну. Визначте, скількома способами можна піднятися на задану сходинку.

Завдання 4

Напишіть рекурсивну функцію, яка обчислює суму натуральних чисел, які входять до заданого проміжку.

Завдання 5

Створіть функцію quadratic_equation, яка приймає на вхід 3 параметри: a, b, c. Усередині цієї функції створити змінні x1, x2 зі значенням None (спочатку приймаємо, що рівняння не має коренів) та функцію calc_rezult з формальними параметрами зовнішньої функції quadratic_equation. Всередині функції calc_rezult здійснити пошук дискримінанта, згідно з результатом якого зробити розрахунок коренів рівняння. Зовнішня функція quadratic_equation має повернути перелік значень коренів квадратного рівняння. Надати можливість користувачеві ввести з клавіатури формальні параметри для передачі їх у створену функцію quadratic_equation, результати роботи функції відобразити на екрані.

"""