'''
Завдання 1
Створіть гру BlackJack на Python


Додаткові матеріали:

Створення гри BlackJack на Python з нуля. Частина 1

Створення гри BlackJack на Python нуля. Частина 2

Робота з GIT



Вимоги:

·       Вихідний код має бути розміщений на github або іншому подібному сервісі.

·       Створіть архітектуру застосунку на рівні класів.

·       У грі обов'язково мають бути класи Player та Game.

·       Успадкування та композиція.

·       Також використовуйте абстракцію.

·       Створення спеціальних типів даних.

·       Додайте зв'язок компонентів між собою.

·       Наприкінці додайте тестування (за можливістю).

'''