'''
OOP. 1

Прізвище

Рік народження

Посада

Зарплата

Освіта


Визначити наймолодшого працівника та надрукувати відомості про нього.

OOP. 2

Прізвище

Група

Рік народження

оцінка з фізики

оцінка з математики

оцінка з інформатики


Надрукувати прізвища студентів, які склали математику на «95», і визначити їхню кількість.

+метод принт для виводу результату зробити за допомогою итератора
+ метод для запису результатив до файлу by CBS Trainer
CBS Trainer
Translate
+ метод для запису результатив до файлу
+ метод зчитування з файлу до консоли by CBS Trainer
CBS Trainer
Translate
+ метод зчитування з файлу до консоли
has context menu
'''


