"""
Практика
1   Поля
Прізвище
Амплуа
Вік
Кількість ігор
Кількість голів
Визначити найкращого форварда, і вивести відомості про футболістів, які зіграли менше 5-ти ігор.
------------------------------------------------------------
2   Поля
Прізвище
Група
Фізика
Інформ
Історія
Визначити середній бал оцінок з всіх предметів, і вивести відомості про ня про студентів, середній бал яких більший за 4 яких більше 4.
------------------------------------------------------------
3   Поля
Продавець
Найменування
Кількість
Ціна
Дата_продажу
Визначити кількість товарів, які продані менше року тому і вивести відомості про них.
"""