'''
Завдання 3

Створіть фоторедактор на Python.

Додаткові матеріали:
Відтворити відео


Вимоги:
• Вихідний код має бути розміщений на github або іншому подібному сервісі.
• Створіть архітектуру застосунку на рівні класів.
• Необхідно розробити та реалізувати графічний інтерфейс.
• У застосунку обов'язково мають бути клас ImageProcessor.
• Декомпозиція та композиція.
• Інкапсуляція, успадкування, поліморфізм, обробка подій.
• Створення спеціальних типів даних.
• Додайте зв'язок компонентів між собою.
• Наприкінці додайте тестування (за можливістю).


'''